app/views/calcs/show.html.erb

<h2>
	<%= SpellCalc::DAMAGE_SPELLS.find {|x| x["key"] == @calc.key }["name"] %>
---
SELECT  "calcs".* FROM "calcs"  WHERE "calcs"."id" = $1 LIMIT 1  [["id", 1]]