app/controllers/calcs_controller.rb

  def create
  	require 'SpellCalc'
  	sc = SpellCalc.new
  	@calc = Calc.new(calc_params)
  	max_hash = sc.get_max(@calc.attack_damage, @calc.bonus_attack_damage, @calc.ability_power, @calc.ult, @calc.fight_time, @calc.cooldown_reduction)
  	@calc.key = max_hash["key"]
  	@calc.damage = max_hash["damage"]
  	@calc.description = max_hash["description"]
  	if @calc.save
---
INSERT INTO "calcs" ("attack_damage", "created_at", "key", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attack_damage", "12.0"], ["created_at", "2014-11-09 22:16:40.348636"], ["key", "TEST"], ["updated_at", "2014-11-09 22:16:40.348636"]]

  def show
  	@calc = Calc.find(params[:id])
---
SELECT  "calcs".* FROM "calcs"  WHERE "calcs"."id" = $1 LIMIT 1  [["id", 1]]